{
  "book": [
    {
      "id": "1",
      "book": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "slug": "catcher-in-the-rye",
      "description": "Anyone who has read J.D. Salinger's New Yorker stories, particularly A Perfect Day for Bananafish, Uncle Wiggily in Connecticut, The Laughing Man, and For Esme--With Love and Squalor, will not be surprised by the fact that his first novel is full of children. The hero-narrator of THE CATCHER IN THE RYE is an ancient child of sixteen, a native New Yorker named Holden Caulfield. Through circumstances that tend to preclude adult, secondhand description, he leaves his prep school in Pennsylvania and goes underground in New York City for three days. The boy himself is at once too simple and too complex for us to make any final comment about him or his story. Perhaps the safest thing we can say about Holden is that he was born in the world not just strongly attracted to beauty but, almost, hopelessly impaled on it. There are many voices in this novel: children's voices, adult voices, underground voices--but Holden's voice is the most eloquent of all. Transcending his own vernacular, yet remaining marvelously faithful to it, he issues a perfectly articulated cry of mixed pain and pleasure. However, like most lovers and clowns and poets of the higher orders, he keeps most of the pain to, and for, himself. The pleasure he gives away, or sets aside, with all his heart. It is there for the reader who can handle it to keep.",
      "price": "23",
      "imgUrl": "https://www.asiabooks.com/media/catalog/product/cache/a5ac216be58c0cbce1cb04612ece96dc/9/7/9780316769488_1.jpg"
    },
    {
      "id": "2",
      "book": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "slug": "to-kill-a-mockingbird",
      "description": "The unforgettable novel of a childhood in a sleepy Southern town and the crisis of conscience that rocked it, To Kill A Mockingbird became both an instant bestseller and a critical success when it was first published in 1960. It went on to win the Pulitzer Prize in 1961 and was later made into an Academy Award-winning film, also a classic.Compassionate, dramatic, and deeply moving, To Kill A Mockingbird takes readers to the roots of human behavior - to innocence and experience, kindness and cruelty, love and hatred, humor and pathos. Now with over 18 million copies in print and translated into forty languages, this regional story by a young Alabama woman claims universal appeal. Harper Lee always considered her book to be a simple love story. Today it is regarded as a masterpiece of American literature.",
      "price": "49.99",

      "imgUrl": "https://m.media-amazon.com/images/I/71FxgtFKcQL._AC_UF1000,1000_QL80_.jpg",

      "shopLinks": [
        {
          "websiteName": "Amazon",
          "bookLinks": "https://www.amazon.com/s?k=To+Kill+a+Mockingbird&i=stripbooks&adid=082VK13VJJCZTQYGWWCZ&campaign=211041&creative=374001&tag=x_gr_bb_amazon-20&ref=x_gr_bb_amazon"
        },
        {
          "websiteName": "Audible",
          "bookLinks": "https://www.amazon.com/s?k=To+Kill+a+Mockingbird&i=audible&tag=x_gr_w_bb_audible-20&ref=x_gr_w_bb_audible-20"
        },
        {
          "websiteName": "Barnes & Noble",
          "bookLinks": "https://www.barnesandnoble.com/s/To+Kill+a+Mockingbird"
        },
        {
          "websiteName": "AbeBooks",
          "bookLinks": "https://www.abebooks.com/servlet/SearchResults?tn=To%20Kill%20a%20Mockingbird&clickid=zFmQXtTRhxyPUrhy9QQ40yE6UkHUrDUVqQuyys0&cm_mmc=aff-_-ir-_-64613-_-77416&ref=imprad64613&afn_sr=impact&ref_=aff_ir_64613_77416"
        }
      ],

      "authorBio": "Harper Lee, known as Nelle, was born in the Alabama town of Monroeville, the youngest of four children of Amasa Coleman Lee and Frances Cunningham Finch Lee. Her father, a former newspaper editor and proprietor, was a lawyer who served on the state legislature from 1926 to 1938. As a child, Lee was a tomboy and a precocious reader, and enjoyed the friendship of her schoolmate and neighbor, the young Truman Capote.\nAfter graduating from high school in Monroeville, Lee enrolled at the all-female Huntingdon College in Montgomery (1944-45), and then pursued a law degree at the University of Alabama (1945-50), pledging the Chi Omega sorority. While there, she wrote for several student publications and spent a year as editor of the campus humor magazine, \"Ramma-Jamma\". Though she did not complete the law degree, she studied for a summer in Oxford, England, before moving to New York in 1950, where she worked as a reservation clerk with Eastern Air Lines and BOAC.\nLee continued as a reservation clerk until the late 50s, when she devoted herself to writing. She lived a frugal life, traveling between her cold-water-only apartment in New York to her family home in Alabama to care for her father.\nHaving written several long stories, Harper Lee located an agent in November 1956. The following month at the East 50th townhouse of her friends Michael Brown and Joy Williams Brown, she received a gift of a year's wages with a note: \"You have one year off from your job to write whatever you please. Merry Christmas.\"\nWithin a year, she had a first draft. Working with J. B. Lippincott & Co. editor Tay Hohoff, she completed To Kill a Mockingbird in the summer of 1959. Published July 11, 1960, the novel was an immediate bestseller and won great critical acclaim, including the Pulitzer Prize for Fiction in 1961. It remains a bestseller with more than 30 million copies in print. In 1999, it was voted \"Best Novel of the Century\" in a poll by the Library Journal."
    },
    {
      "id": "3",
      "book": "1984",
      "author": "George Orwell",
      "slug": "1984",
      "description": "Winston Smith toes the Party line, rewriting history to satisfy the demands of the Ministry of Truth. With each lie he writes, Winston grows to hate the Party that seeks power for its own sake and persecutes those who dare to commit thoughtcrimes. But as he starts to think for himself, Winston can’t escape the fact that Big Brother is always watching... A startling and haunting novel, 1984 creates an imaginary world that is completely convincing from start to finish. No one can deny the novel’s hold on the imaginations of whole generations, or the power of its admonitions—a power that seems to grow, not lessen, with the passage of time.",
      "price": "20",
      "imgUrl": "https://cdn-local.mebmarket.com/meb/server1/59412/Thumbnail/book_detail_large.gif?8"
    },
    {
      "id": "4",
      "book": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "slug": "the-great-gatsby",
      "description": "The Great Gatsby, F. Scott Fitzgerald’s third book, stands as the supreme achievement of his career. First published in 1925, this quintessential novel of the Jazz Age has been acclaimed by generations of readers. The story of the mysteriously wealthy Jay Gatsby and his love for the beautiful Daisy Buchanan, of lavish parties on Long Island at a time when The New York Times noted “gin was the national drink and sex the national obsession,” it is an exquisitely crafted tale of America in the 1920s.",
      "price": "42",
      "imgUrl": "https://upload.wikimedia.org/wikipedia/commons/7/7a/The_Great_Gatsby_Cover_1925_Retouched.jpg"
    },
    {
      "id": "5",
      "book": "Harry Potter and the Philosopher's Stone",
      "author": "J.K. Rowling",
      "slug": "harry-potter",
      "description": "Harry Potter has never even heard of Hogwarts when the letters start dropping on the doormat at number four, Privet Drive. Addressed in green ink on yellowish parchment with a purple seal, they are swiftly confiscated by his grisly aunt and uncle. Then, on Harry's eleventh birthday, a great beetle-eyed giant of a man called Rubeus Hagrid bursts in with some astonishing news: Harry Potter is a wizard, and he has a place at Hogwarts School of Witchcraft and Wizardry. An incredible adventure is about to begin!",
      "price": "39.99",
      "imgUrl": "https://bci.kinokuniya.com/th/jsp/images/book-img/97814/97814088/9781408855652.JPG"
    },
    {
      "id": "6",
      "book": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "slug": "the-hobbit",
      "description": "This definitive paperback edition features nine illustrations and two maps drawn by J.R.R. Tolkien, and a preface by Christopher Tolkien. Bilbo Baggins is a hobbit who enjoys a comfortable, unambitious life, rarely travelling further than the pantry of his hobbit-hole in Bag End. But his contentment is disturbed when the wizard, Gandalf, and a company of thirteen dwarves arrive on his doorstep one day to whisk him away on an unexpected journey 'there and back again'. They have a plot to raid the treasure hoard of Smaug the Magnificent, a large and very dangerous dragon...The prelude to The Lord of the Rings, The Hobbit has sold many millions of copies since its publication in 1937, establishing itself as one of the most beloved and influential books of the twentieth century.",
      "price": "28",
      "imgUrl": "https://www.asiabooks.com/media/catalog/product/cache/a5ac216be58c0cbce1cb04612ece96dc/9/7/9780261102217c_1.jpg"
    },
    {
      "id": "7",
      "book": "Pride and Prejudice",
      "author": "Jane Austen",
      "slug": "pride-and-prejudice",
      "description": "Until he was past forty Sterne had apparently no thought of authorship and had published nothing but one or two sermons. About i74s, however, the success of a privately circulated skit on a local ecclesiastical quarrel suggested a new line of activity, the result of which appeared in the first two books of Tristram Shandy, published at York, January 1, 1760. Their success was great and immediate.",
      "price": "19",
      "imgUrl": "https://m.media-amazon.com/images/I/71Q1tPupKjL._AC_UF1000,1000_QL80_.jpg"
    },
    {
      "id": "8",
      "book": "The Lord of the Rings",
      "author": "J.R.R. Tolkien",
      "slug": "the-lord-of-the-rings",
      "description": "In ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, the Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth, it remained lost to him. After many ages it fell by chance into the hands of the hobbit Bilbo Baggins.From Sauron's fastness in the Dark Tower of Mordor, his power spread far and wide. Sauron gathered all the Great Rings, but always he searched for the One Ring that would complete his dominion. When Bilbo reached his eleventy-first birthday he disappeared, bequeathing to his young cousin Frodo the Ruling Ring and a perilous quest: to journey across Middle-earth, deep into the shadow of the Dark Lord, and destroy the Ring by casting it into the Cracks of Doom.The Lord of the Rings tells of the great quest undertaken by Frodo and the Fellowship of the Ring: Gandalf the Wizard; the hobbits Merry, Pippin, and Sam; Gimli the Dwarf; Legolas the Elf; Boromir of Gondor; and a tall, mysterious stranger called Strider.",
      "price": "40",
      "imgUrl": "https://m.media-amazon.com/images/I/71jLBXtWJWL._AC_UF1000,1000_QL80_.jpg"
    },
    {
      "id": "9",
      "book": "The Hunger Games",
      "author": "Suzanne Collins",
      "slug": "the-hunger-games",
      "description": "In the ruins of a place once known as North America lies the nation of Panem, a shining Capitol surrounded by twelve outlying districts. Long ago the districts waged war on the Capitol and were defeated. As part of the surrender terms, each district agreed to send one boy and one girl to appear in an annual televised event called, The Hunger Games, a fight to the death on live TV. Sixteen-year-old Katniss Everdeen, who lives alone with her mother and younger sister, regards it as a death sentence when she is forced to represent her district in the Games. The terrain, rules, and level of audience participation may change but one thing is constant: kill or be killed.",
      "price": "28",
      "imgUrl": "https://m.media-amazon.com/images/I/61I24wOsn8L._AC_UF1000,1000_QL80_.jpg"
    },
    {
      "id": "10",
      "book": "Frankenstein",
      "author": "Mary Shelley",
      "slug": "frankenstein",
      "description": "Few creatures of horror have seized readers' imaginations and held them for so long as the anguished monster of Mary Shelley's Frankenstein. The story of Victor Frankenstein's terrible creation and the havoc it caused has enthralled generations of readers and inspired countless writers of horror and suspense. Considering the gothic novel's enduring success, it is remarkable that it began merely as a whim of Lord Byron's.",
      "price": "39",
      "imgUrl": "https://m.media-amazon.com/images/I/81TVqiv-ctL._AC_UF1000,1000_QL80_.jpg"
    },
    {
      "id": "11",
      "book": "Atomic Habit",
      "author": "Jame Clear",
      "slug": "atomic-habit",
      "description": "Atomic Habits will reshape the way you think about progress and success, and give you the tools and strategies you need to transform your habits--whether you are a team looking to win a championship, an organization hoping to redefine an industry, or simply an individual who wishes to quit smoking, lose weight, reduce stress, or achieve any other goal.",
      "price": "13.85",
      "imgUrl": "https://m.media-amazon.com/images/I/81YkqyaFVEL._SY342_.jpg"
    },
    {
      "id": "12",
      "book": "Iron Flame",
      "author": "Rebecca Yarrors",
      "slug": "iron-flame",
      "description": "Everyone expected Violet Sorrengail to die during her first year at Basgiath War College―Violet included. But Threshing was only the first impossible test meant to weed out the weak-willed, the unworthy, and the unlucky.Now the real training begins, and Violet’s already wondering how she’ll get through. It’s not just that it’s grueling and maliciously brutal, or even that it’s designed to stretch the riders’ capacity for pain beyond endurance. It’s the new vice commandant, who’s made it his personal mission to teach Violet exactly how powerless she is–unless she betrays the man she loves.Although Violet’s body might be weaker and frailer than everyone else’s, she still has her wits―and a will of iron. And leadership is forgetting the most important lesson Basgiath has taught her: Dragon riders make their own rules.",
      "price": "18.85",
      "imgUrl": "https://m.media-amazon.com/images/I/917Bc9C1MlL._SY342_.jpg"
    },
    {
      "id": "13",
      "book": "Spare",
      "author": "Prince Harry",
      "slug": "spare",
      "description": "It was one of the most searing images of the twentieth century: two young boys, two princes, walking behind their mother’s coffin as the world watched in sorrow—and horror. As Princess Diana was laid to rest, billions wondered what Prince William and Prince Harry must be thinking and feeling—and how their lives would play out from that point on.For Harry, this is that story at last.",
      "price": "18.85",
      "imgUrl": "https://m.media-amazon.com/images/I/91Szm8FpdfL._SY342_.jpg"
    },
    {
      "id": "14",
      "book": "Fourth Wing",
      "author": "Rebecca Yarrors",
      "slug": "fourth-wing",
      "description": "Twenty-year-old Violet Sorrengail was supposed to enter the Scribe Quadrant, living a quiet life among books and history. Now, the commanding general―also known as her tough-as-talons mother―has ordered Violet to join the hundreds of candidates striving to become the elite of Navarre: dragon riders. But when you’re smaller than everyone else and your body is brittle, death is only a heartbeat away...because dragons don’t bond to “fragile” humans. They incinerate them. With fewer dragons willing to bond than cadets, most would kill Violet to better their own chances of success. The rest would kill her just for being her mother’s daughter―like Xaden Riorson, the most powerful and ruthless wingleader in the Riders Quadrant.",
      "price": "16.88",
      "imgUrl": "https://m.media-amazon.com/images/I/91n7p-j5aqL._SY342_.jpg"
    },
    {
      "id": "15",
      "book": "The Boy Keeps The Score",
      "author": "Bassel van der Kolk",
      "slug": "the-boy-keeps-the-score",
      "description": "Trauma is a fact of life. Veterans and their families deal with the painful aftermath of combat; one in five Americans has been molested; one in four grew up with alcoholics; one in three couples have engaged in physical violence. Dr. Bessel van der Kolk, one of the world’s foremost experts on trauma, has spent over three decades working with survivors. In The Body Keeps the Score, he uses recent scientific advances to show how trauma literally reshapes both body and brain, compromising sufferers’ capacities for pleasure, engagement, self-control, and trust. He explores innovative treatments—from neurofeedback and meditation to sports, drama, and yoga—that offer new paths to recovery by activating the brain’s natural neuroplasticity. Based on Dr. van der Kolk’s own research and that of other leading specialists, The Body Keeps the Score exposes the tremendous power of our relationships both to hurt and to heal—and offers new hope for reclaiming lives.",
      "price": "10.19",
      "imgUrl": "https://m.media-amazon.com/images/I/71-OnTj8N8L._AC_UF1000,1000_QL80_.jpg"
    }
  ],
  "user": [
    {
      "id": "1",
      "name": "day",
      "email": "saingwann@gmail.com",
      "password": "123456"
    },
    {
      "id": "2",
      "name": "day2",
      "email": "day.dev@gmail.com",
      "password": "123456"
    }
  ]
}
